## üß© What is GroupBy in Pandas?

**GroupBy** is like grouping students by their grade and then calculating statistics (like average marks) for each group.

---

### üí° Real-life Analogy:

Suppose you are a **teacher**.

You want to know the **average marks** for each class (e.g., Class A, Class B, Class C).

‚úÖ You would **group students by class** and then **calculate average**.

---

üéØ This is **exactly** what `GroupBy` in Pandas does!

It lets you:
- Group data by one or more columns
- Apply functions like `mean()`, `sum()`, `count()`, `max()` etc. on each group

**üß† Syntax**

`grouped_data = df.groupby('column_name').methodName()`

| Function    | Description                      |
| ----------- | -------------------------------- |
| `.mean()`   | Average of values in each group  |
| `.sum()`    | Sum of values in each group      |
| `.count()`  | Number of items in each group    |
| `.min()`    | Minimum value in each group      |
| `.max()`    | Maximum value in each group      |
| `.median()` | Median value in each group       |
| `.std()`    | Standard deviation in each group |

In [3]:
import pandas as pd

students = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Class': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Marks': [85, 90, 95, 70, 88, 76]
}

df = pd.DataFrame(students)
df

      Name Class  Marks
0    Alice     A     85
1      Bob     B     90
2  Charlie     A     95
3    David     B     70
4      Eva     A     88
5    Frank     B     76

In [9]:
grouped_by_class = df.groupby('Class')
# üìä Get average marks per class
print(grouped_by_class['Marks'].mean())

Class
A    89.333333
B    78.666667
Name: Marks, dtype: float64

üõ†Ô∏è GroupBy Attributes and Methods
| Attribute / Method | Description                                        |
| ------------------ | -------------------------------------------------- |
| `.groups`          | Shows groups and row indices                       |
| `.get_group()`     | Get rows for a specific group                      |
| `.agg()`           | Apply multiple aggregation functions               |
| `.apply()`         | Apply custom function to each group                |
| `.transform()`     | Return group-wise values aligned to original index |

In [14]:
# GroupBy with Multiple Aggregations
# üî¢ Group and apply multiple aggregations
print(grouped_by_class['Marks'].agg(['mean', 'max', 'min']))

            mean  max  min
Class
A      89.333333   95   85
B      78.666667   90   70

In [15]:
# Using .get_group()
grouped_by_class.get_group('A')

      Name Class  Marks
0    Alice     A     85
2  Charlie     A     95
4      Eva     A     88

In [16]:
# üèè Hands-On IPL Dataset Example (Simplified)
# Let‚Äôs say you have an IPL dataset like:
data = {
    'Player': ['Kohli', 'Rohit', 'Maxwell', 'SKY', 'Dhoni'],
    'Team': ['RCB', 'MI', 'RCB', 'MI', 'CSK'],
    'Runs': [80, 70, 60, 90, 50]
}

ipl = pd.DataFrame(data)

# üß† Group by Team
team_group = ipl.groupby('Team')

# üìä Total Runs per Team
print(team_group['Runs'].sum())

# üìà Average Runs per Team
print(team_group['Runs'].mean())

Team
CSK     50
MI     160
RCB    140
Name: Runs, dtype: int64
Team
CSK    50.0
MI     80.0
RCB    70.0
Name: Runs, dtype: float64